app/views/barcodes/index.html.erb

<% Barcode.all.each do |code| %>
---
SELECT  "barcodes".* FROM "barcodes"  ORDER BY "barcodes"."id" DESC LIMIT 1