app/views/barcodes/show.html.erb

<%= Barcode.last.soss_number %>
---
SELECT  "barcodes".* FROM "barcodes"  ORDER BY "barcodes"."id" DESC LIMIT 1

      <script>
      $("#<%=Barcode.last.soss_number%>").JsBarcode("PWZ-<%=Barcode.last.soss_number%>",{displayValue:true});
---
SELECT  "barcodes".* FROM "barcodes" WHERE "barcodes"."soss_number" = ? LIMIT 1  [["soss_number", "11111"]]