app/controllers/barcodes_controller.rb

  def index
    @barcodes = Barcode.all
---
SELECT "barcodes".* FROM "barcodes"

  def create
    @barcode = Barcode.create(code_params)
---
INSERT INTO "barcodes" ("soss_number", "created_at", "updated_at") VALUES (?, ?, ?)  [["soss_number", "323232"], ["created_at", "2015-06-16 07:29:45.231639"], ["updated_at", "2015-06-16 07:29:45.231639"]]

  def generate
    @amount = params[:amount]
    @barcode = Barcode.new
    if @amount != nil
      @amount.to_i.times do |x|
      last_barcode = Barcode.last.soss_number
        Barcode.create(soss_number: last_barcode.to_i + 1).save
---
SELECT  "barcodes".* FROM "barcodes"  ORDER BY "barcodes"."id" DESC LIMIT 1
INSERT INTO "barcodes" ("soss_number", "created_at", "updated_at") VALUES (?, ?, ?)  [["soss_number", "11113"], ["created_at", "2015-06-16 08:07:05.433270"], ["updated_at", "2015-06-16 08:07:05.433270"]]

  def search
    @barcode = Barcode.find_by(soss_number: params[:number])
---
SELECT  "barcodes".* FROM "barcodes" WHERE "barcodes"."soss_number" = ? LIMIT 1  [["soss_number", "11111"]]

  def last
    @barcodes = Barcode.last(params[:number].to_i)
---
SELECT  "barcodes".* FROM "barcodes"  ORDER BY "barcodes"."id" DESC LIMIT 10